# LayerCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..LayerCount Property
CompoundStructure Class See Also
---
Returns the number of layers contained in this CompoundStructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int LayerCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LayerCount As Integer
	Get
```

Visual C++
---
```text
public:
property int LayerCount {
	int get ();
}
```

# Remarks
Establishes the valid range of indices passed to various access functions: [0 ... this value - 1]
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace